{"videos":[{"id":"b17a97dd-ee55-4fde-acca-c980beee2f4f","url":"https://youtube.com/shorts/b2oE2t7OyoA?si=NCA1kk5YsyH-eybW","user":"cernev","platform":"shorts","transcription":"А вы знаете, что Централ Парк вообще не должен был существовать? В изначальном плане Нью-Йорка его не было. Сначала весь город был небольшим поселением внизу Манхэттена, а в этой части острова почти никто не жил. В основном здесь были болота, но потом Нью-Йорк начал расти. Весь остров решили покрыть сеткой из улиц. Вот план, по которому должен был застраиваться Нью-Йорк. И никакого Централ Парка тут нет. Но жить в такой плотной застройке было сложно. И тогда власти решили, что людям нужно немножко природы. Они приняли целый закон, по которому вся эта территория застраиваться не будет. И вообще-то это очень много земли. Например, так выглядел бы Централ Парк в Москве. Причем ради парка всю природу переделали заново. Все, что здесь есть, это часть большого дизайн-проекта. Каждое дерево, каждый камень, каждый куст поместили сюда специально. Земля, которая была почти никому не нужна, стала одной из самых известных точек в мире. Квартиры с видом на Централ Парк стоят десятки миллионов долларов. И несмотря на то, что это огромный кусок земли в самом центре Нью-Йорка, который может стоить бешеных денег, этот парк никогда не застроят.","summary":"В данном видео рассказывается о том, что Центральный парк в Нью-Йорке изначально не планировался и вместо него должна была быть густая застройка города. Однако власти приняли решение оставить эту землю под парк из-за необходимости природного пространства для жителей.","title":"Почему Центральный парк не должен существовать?","tags":"история, Центральный парк, Нью-Йорк","createdAt":"2024-08-15T22:11:05.124674"},{"id":"06b3b40f-0df4-4757-925c-64639e951f75","url":"https://youtube.com/shorts/dl_wtssa9vU?si=OU5hYeh9Oxqsouif","user":"cernev","platform":"shorts","transcription":"Don't you just love it when something you think just looks cool also turns out to be an actual quality product? I picked up this keyboard purely because of the color and this little handle on the side only to learn about one of the most interesting keyboard features I've ever seen. It's called the Field 75 by Nufi and it sounds like this. The outer shell has this finish that's almost soft to the touch, but the board itself is thick and heavy and it really compliments the tactile, fleeting gold switches that came with mine. The volume control knob sounds so good it's like scratching your brain and the only downside is you can't program it for anything else, just for sound. But the absolute best part is this space bar with these two silicone sound absorbers that sit directly under the keycap. Nufi calls it their ghost bar, but I just call it smooth as heck. And if this thing only had a delete key right out of the box, it'd be perfect in my book, I'm just saying.","summary":"This video showcases the Field 75 keyboard by Nufi, highlighting its unique features like a soft touch finish, tactile gold switches, and a volume control knob that provides a satisfying sound. The keyboard also has a space bar with silicone sound absorbers named the ghost bar, making typing smooth and quiet.","title":"Review of the innovative Field 75 keyboard by Nufi","tags":"technology, keyboard, Nufi","createdAt":"2024-07-07T22:54:30.203788887"},{"id":"0f4f873a-ab21-4988-ab04-ad1b9a23fb22","url":"https://youtube.com/shorts/ME3LdIOhBTM?si=r-jsyA78_-dbGUe3","user":"cernev","platform":"shorts","transcription":"This open source project is better than ChatGPT and completely free. Now, OpenWebUI basically tries to mimic the functionality of ChatGPT, but connects with OLAMA to run your models locally on your machine. I'm fine-tuning PHY3 Mini with function calling, so I'm able to just plug it into this interface to demo it and see if it's good enough. And I mean, cool, this is whatever. But the real cool part is customization through pipelines. Here we can inject any code that we want at whatever process, like adding profanity filters or post-LLM cleanup. Sadly though, it is a bit early, so good luck if you decide to experiment with it. Compared to UbaBuga, there's not nearly as many features, but for basic usage, it's much cleaner and easier way to get started with local models. And the best part is that you just need to run a simple docker command to just get this up and running. There's a ton of features if you're into large language models, building AI apps, whatever it is, I highly recommend you try this to just demo everything.","summary":"In this video, the speaker introduces an open source project called OpenWebUI, which aims to mimic the functionality of ChatGPT by connecting with OLAMA to run models locally on the user's machine. The video highlights fine-tuning models like PHY3 Mini with function calling and customization features through pipelines for tasks like adding profanity filters or post-LLM cleanup.","title":"Introducing OpenWebUI: Free alternative to ChatGPT","tags":"technology, open source, AI","createdAt":"2024-07-25T08:09:45.806198422"},{"id":"102fc2f2-cec8-4c8a-a737-388a4c87ce62","url":"https://youtube.com/shorts/IvlVVPAZ3r4?si=IaQEWhelvWmrLdk2","user":"cernev","platform":"shorts","transcription":"These are four underrated muscle building exercises that most people skip, but you should definitely include if you can. First, deficit pushups. A lot of people think of pushups as a beginner exercise, but as long as you use a deficit, you'll get an amazing pec stimulus. To make them harder, I'll pause for three seconds at the bottom. Second, the standard overhand lat pulldown. A lot of optimal lifters will skip this one in favor of the one-arm kneeling lat pulldown, but despite the fact that people call it more science-based, there actually isn't a single study on it. Sure, it's great for isolating the lats, but the standard lat pulldown is better for overloading more of the back as a whole. Third, the 45-degree preacher curl. It locks your elbow in, which prevents cheating, and because of the dumbbell's resistance path, it applies high tension in the stretch. Just don't do them with a vertical arm because you'll have zero tension at the bottom. Fourth, Smith machine squats are great because there's less skill involved, so you don't need to overthink your form or worry about falling over. You can just hammer your quads and get close to failure.","summary":"This video highlights four underrated muscle-building exercises that are often overlooked but highly effective, including deficit pushups for pecs, standard overhand lat pulldowns for back, 45-degree preacher curls for biceps, and Smith machine squats for quads.","title":"4 Underrated Muscle Building Exercises You Need To Try","tags":"fitness, muscle building, workout tips","createdAt":"2024-07-07T22:59:04.473824243"},{"id":"2281f64e-13fc-4a64-84bb-032d489376e5","url":"https://vm.tiktok.com/ZMrpXs9xU/","user":"cernev","platform":"tiktok","transcription":"It's 5.06am, here's my morning routine. This works fantastic no matter what time of day you wake up. First things first, I haven't been able to because I haven't had one, but I just got a brand new cold plunge, so I'm going to go hop in that. This morning routine takes 20 minutes, the cold plunge is not required, the rest of it will make you feel fantastic. I just fell on the very first stair walking down here and saw my life flash before my eyes and now I'm wide awake. I never want to do this, and I haven't had a cold plunge in a while, so this is going to be extra hard. I never want to do it, but I always am so glad I did it once I get out. Energy boost, the mental clarity, the dopamine hit, it can't be, it can't be beat. Ouch. Just like that. It hurt like shit, but two and a half minutes of pain, I immediately feel incredible. It's worth it for a whole day of feeling better. Alright, I'm feeling incredible now, wide awake. The reason I do the cold plunge is simple. It creates a surge in what's called your catecholamines, that's your epinephrine, norepinephrine, and dopamine. That's going to be associated with mental acuity, higher energy levels, and a sense of well-being and motivation. Obviously a great feeling to start your day. Cold showers work too. Alright, next thing in the list, morning salt water. If you've followed me for a while, you know how important it is to get water with electrolytes in the morning, not just water. I bounce around from electrolytes up to electrolytes up, but Optimized Minerals is easily the most complete one I've ever seen. This is actually more of a mineral supplement than a pure electrolyte supplement because it's actually a little low in sodium, but everything else in here, unbelievable. I add about a half a teaspoon of salt on top of this, and I feel mentally incredible when I'm taking this stuff. It's a little bit expensive, but it is incredible. I'm going to knock this back and then take a 15 minute walk. The reason for the water with electrolytes is because once you've gone to sleep, you haven't had any fluids in at least 8, sometimes 10 or 12 hours, but you also need electrolytes like sodium, potassium, and magnesium to allow your brain and muscles to function properly. Your brain works on electrical charges, electrolytes help to better conduct those charges. I know it's dark, I'm sorry it's still early, but the next step in the morning routine is some light physical activity. Get the heart rate up, get the blood flowing. You can also go to the gym, I just prefer to walk. And now I'm going to spend 5 to 10 minutes just in the morning sunlight, letting it hit my eyeballs directly. This is important because it tells your body and your brain, hey, it's daytime, do the daytime things. So you're going to get a nice natural cortisol rise, which is good. You're going to feel boosted at energy levels, more mental clarity. Like I said, you only need 5 to 10 minutes, so if you wake up when it's dark outside and go to work, find 5 minutes to step outside in the morning sunlight when you're there. Not only are you going to feel clearer and more energetic from the morning sunlight, the morning sunlight on your eyes will trigger a melatonin release 12 to 14 hours later. So it really supports our natural sleeping and waking rhythms. And also look at what you miss when you don't check out the sunrise for just 5 minutes. That is the most questionable van I've seen in a minute. The last thing you do for this is just delay your caffeine intake for an hour to an hour and a half after you wake up. I know it's difficult, but this will allow the adenosine to clear out of your brain from the night before. It will make the caffeine hit a little bit harder when you do take it, and it will mitigate that mid-afternoon crash you get because that's likely coming from waking up and immediately consuming caffeine. That's the morning routine. That's 4 or 5 simple steps. It doesn't require you to sell your soul and doesn't take 2 hours of your day. If you were to do this whole thing back to back to back, it would take you 15 to 20 minutes tops. And that's my routine in a nutshell, backed by science. Water, light, movement, cold exposure is optional. It isn't easy, but it is simple. ","summary":"This video showcases a morning routine that includes a cold plunge, morning salt water with electrolytes, light physical activity, exposure to morning sunlight, and delaying caffeine intake for increased energy levels, mental clarity, and overall well-being.","title":"Science-backed morning routine for heightened energy and focus","tags":"morning routine, energy boost, wellness","createdAt":"2024-08-13T20:58:00.430475324"},{"id":"2fe48725-d067-4ed1-b48a-4f2e4d267322","url":"https://vm.tiktok.com/ZMrQUaRAd/","user":"cernev","platform":"tiktok","transcription":"Here are four awesome open source projects for developers. Number one, Serverless Examples. Serverless Examples contains a bunch of awesome starter kits and project examples that use the serverless framework. They are fantastic for helping you get started with serverless. Number two, LangChain. LangChain is a framework that helps you to develop software that interacts with large language models. It's compatible with Python and it also has a JavaScript library. Number three, Clean Code JavaScript. Clean Code JavaScript is a fantastic guide that will help you to understand how to write higher quality code. Number four, TensorFlow. TensorFlow is a machine learning framework that makes it so much easier to train and work with machine learning models using Python. Follow for more coding videos.","summary":"This video introduces four awesome open source projects for developers, including Serverless Examples, LangChain, Clean Code JavaScript, and TensorFlow, each serving different purposes from serverless development to machine learning.","title":"Top 4 Open Source Projects for Developers","tags":"development, open source, coding","createdAt":"2024-07-30T04:59:11.504254176"}]}
